In [1]:
import pandas as pd
import pylab as pl
import numpy as np
import scipy.optimize as opt
from sklearn import preprocessing
import matplotlib.pyplot as plt
from sklearn import preprocessing
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import confusion_matrix
from sklearn.metrics import jaccard_score
from sklearn.metrics import log_loss

In [13]:
train = pd.read_csv("data/train_clean.csv")

In [14]:
train.head()

   Unnamed: 0  Survived  Pclass  Sex   Age  SibSp  Parch     Fare  S  Q  Title
0           0         0       3    1  22.0      1      0   7.2500  1  0      1
1           1         1       1    0  38.0      1      0  71.2833  0  0      2
2           2         1       3    0  26.0      0      0   7.9250  1  0      2
3           3         1       1    0  35.0      1      0  53.1000  1  0      2
4           4         0       3    1  35.0      0      0   8.0500  1  0      1

In [16]:
train.drop(["Unnamed: 0"], axis=1 ,inplace=True)

In [17]:
train.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  S  Q  Title
0         0       3    1  22.0      1      0   7.2500  1  0      1
1         1       1    0  38.0      1      0  71.2833  0  0      2
2         1       3    0  26.0      0      0   7.9250  1  0      2
3         1       1    0  35.0      1      0  53.1000  1  0      2
4         0       3    1  35.0      0      0   8.0500  1  0      1

In [18]:
X_train = train.iloc[:, 1:10]
y_train = train.iloc[:, 0]

In [20]:
X_train.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  S  Q
0       3    1  22.0      1      0   7.2500  1  0
1       1    0  38.0      1      0  71.2833  0  0
2       3    0  26.0      0      0   7.9250  1  0
3       1    0  35.0      1      0  53.1000  1  0
4       3    1  35.0      0      0   8.0500  1  0

In [22]:
test = pd.read_csv("data/test.csv")

In [23]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S